import '../models/question.dart';

final List<Question> allQuestions = [
  Question(
    text: "ما هي المدينة الملقبة بالوردية؟",
    options: ["البتراء", "جرش", "العقبة", "عمان"],
    correctAnswer: "البتراء",
  ),
  Question(
    text: "أخفض بقعة على وجه الأرض؟",
    options: ["البحر الميت", "الأغوار", "وادي النخر", "وادي الموجب"],
    correctAnswer: "البحر الميت",
  ),
  Question(
    text: "أين يقع \"وادي القمر\"؟",
    options: ["وادي رم", "وادي الموجب", "وادي بن حماد", "الأشعري"],
    correctAnswer: "وادي رم",
  ),
  Question(
    text: "مدينة الأطلال الرومانية والمسارح؟",
    options: ["جرش", "عجلون", "أم قيس", "مأدبا"],
    correctAnswer: "جرش",
  ),
  Question(
    text: "ما هي لؤلؤة البحر الأحمر في الأردن؟",
    options: ["العقبة", "إربد", "السلط", "الكرك"],
    correctAnswer: "العقبة",
  ),
  Question(
    text: "ما هو الجبل الذي يطل على وادي الأردن ونهر الأردن؟",
    options: ["جبل نيبو", "جبل القلعة", "جبل اللويبدة", "جبل عمان"],
    correctAnswer: "جبل نيبو",
  ),
  Question(
    text: "ما هي الأكلة الشعبية الأولى في الأردن؟",
    options: ["المنسف", "المقلوبة", "المسخن", "الكباب"],
    correctAnswer: "المنسف",
  ),
  Question(
    text: "ما هو أفضل وقت لزيارة الأردن لطقس معتدل؟",
    options: [
      "مارس إلى مايو",
      "يونيو إلى أغسطس",
      "ديسمبر إلى فبراير",
      "جميع فصول السنة",
    ],
    correctAnswer: "مارس إلى مايو",
  ),
  Question(
    text: "ما هي المدينة التي تقع في أقصى جنوب الأردن؟",
    options: ["العقبة", "الطفيلة", "معان", "الكرك"],
    correctAnswer: "العقبة",
  ),
  Question(
    text: "أين يمكنك الطفو فوق الماء دون غرق؟",
    options: ["البحر الميت", "خليج العقبة", "البحر الأحمر", "نهر الأردن"],
    correctAnswer: "البحر الميت",
  ),
  Question(
    text: "قلعة بناها الصليبيون في الكرك؟",
    options: ["قلعة الكرك", "قلعة الشوبك", "قلعة عجلون", "قلعة عمان"],
    correctAnswer: "قلعة الكرك",
  ),
  Question(
    text: "وادي يعكس طبيعة خلابة ويتميز بمياهه الساخنة؟",
    options: ["حمامات ماعين", "وادي رم", "وادي شعيب", "وادي السير"],
    correctAnswer: "حمامات ماعين",
  ),
  Question(
    text: "مدينة شمالية تعرف بعروس الشمال؟",
    options: ["إربد", "عجلون", "المفرق", "جرش"],
    correctAnswer: "إربد",
  ),
  Question(
    text: "محمية طبيعية في جنوب الأردن تعد الأكبر؟",
    options: ["محمية ضانا", "محمية الشومري", "محمية عجلون", "محمية الموجب"],
    correctAnswer: "محمية ضانا",
  ),
  Question(
    text: "بناء نبطي محفور بالصخر في البتراء؟",
    options: ["الخزنة", "الدير", "المحكمة", "المسرح النبطي"],
    correctAnswer: "الخزنة",
  ),
];
